documentation/design/essn/SubjectManagement/RequestSecurityToken_GlassFish.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema">
   <S:Header>
      <wsse:Security S:mustUnderstand="1">
         <wsse:UsernameToken wsu:Id="UsernameToken-8">
            <wsse:Username>jdoe01</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Aa_111111</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </S:Header>
   <S:Body>
      <ns3:RequestSecurityToken xmlns:ns3="http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:ns6="http://schemas.xmlsoap.org/ws/2004/09/policy">
         <ns3:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue</ns3:RequestType>
         <ns3:TokenType>urn:oasis:names:tc:SAML:1.0:assertion</ns3:TokenType>
         <ns3:KeyType>http://schemas.xmlsoap.org/ws/2005/02/trust/SymmetricKey</ns3:KeyType>
         <ns3:KeySize>128</ns3:KeySize>
      </ns3:RequestSecurityToken>
   </S:Body>
</S:Envelope>